MikroElektronika/core_packages/PIC/XC8/def/PIC18F2480/mcu.h
extern volatile B3DLCbits_t B3DLCbits __at(0xE55);
// bitfield macros
#define _B3DLC_DLC0_POSN                                    0x0
#define _B3DLC_DLC0_POSITION                                0x0
#define _B3DLC_DLC0_SIZE                                    0x1
#define _B3DLC_DLC0_LENGTH                                  0x1
#define _B3DLC_DLC0_MASK                                    0x1
#define _B3DLC_DLC1_POSN                                    0x1
#define _B3DLC_DLC1_POSITION                                0x1
#define _B3DLC_DLC1_SIZE                                    0x1
#define _B3DLC_DLC1_LENGTH                                  0x1
#define _B3DLC_DLC1_MASK                                    0x2
#define _B3DLC_DLC2_POSN                                    0x2
#define _B3DLC_DLC2_POSITION                                0x2
#define _B3DLC_DLC2_SIZE                                    0x1
#define _B3DLC_DLC2_LENGTH                                  0x1
#define _B3DLC_DLC2_MASK                                    0x4
#define _B3DLC_DLC3_POSN                                    0x3
#define _B3DLC_DLC3_POSITION                                0x3
#define _B3DLC_DLC3_SIZE                                    0x1
#define _B3DLC_DLC3_LENGTH                                  0x1
#define _B3DLC_DLC3_MASK                                    0x8
#define _B3DLC_RB0_POSN                                     0x4
#define _B3DLC_RB0_POSITION                                 0x4
#define _B3DLC_RB0_SIZE                                     0x1
#define _B3DLC_RB0_LENGTH                                   0x1
#define _B3DLC_RB0_MASK                                     0x10
#define _B3DLC_RB1_POSN                                     0x5
#define _B3DLC_RB1_POSITION                                 0x5
#define _B3DLC_RB1_SIZE                                     0x1
#define _B3DLC_RB1_LENGTH                                   0x1
#define _B3DLC_RB1_MASK                                     0x20
#define _B3DLC_RXRTR_TXRTR_POSN                             0x6
#define _B3DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B3DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B3DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B3DLC_RXRTR_TXRTR_MASK                             0x40
#define _B3DLC_RESRB0_POSN                                  0x4
#define _B3DLC_RESRB0_POSITION                              0x4
#define _B3DLC_RESRB0_SIZE                                  0x1
#define _B3DLC_RESRB0_LENGTH                                0x1
#define _B3DLC_RESRB0_MASK                                  0x10
#define _B3DLC_RESRB1_POSN                                  0x5
#define _B3DLC_RESRB1_POSITION                              0x5
#define _B3DLC_RESRB1_SIZE                                  0x1
#define _B3DLC_RESRB1_LENGTH                                0x1
#define _B3DLC_RESRB1_MASK                                  0x20
#define _B3DLC_TXRTR_POSN                                   0x6
#define _B3DLC_TXRTR_POSITION                               0x6
#define _B3DLC_TXRTR_SIZE                                   0x1
#define _B3DLC_TXRTR_LENGTH                                 0x1
#define _B3DLC_TXRTR_MASK                                   0x40
#define _B3DLC_RXRTR_POSN                                   0x6
#define _B3DLC_RXRTR_POSITION                               0x6
#define _B3DLC_RXRTR_SIZE                                   0x1
#define _B3DLC_RXRTR_LENGTH                                 0x1
#define _B3DLC_RXRTR_MASK                                   0x40
#define _B3DLC_B3DLC0_POSN                                  0x0
#define _B3DLC_B3DLC0_POSITION                              0x0
#define _B3DLC_B3DLC0_SIZE                                  0x1
#define _B3DLC_B3DLC0_LENGTH                                0x1
#define _B3DLC_B3DLC0_MASK                                  0x1
#define _B3DLC_B3DLC1_POSN                                  0x1
#define _B3DLC_B3DLC1_POSITION                              0x1
#define _B3DLC_B3DLC1_SIZE                                  0x1
#define _B3DLC_B3DLC1_LENGTH                                0x1
#define _B3DLC_B3DLC1_MASK                                  0x2
#define _B3DLC_B3DLC2_POSN                                  0x2
#define _B3DLC_B3DLC2_POSITION                              0x2
#define _B3DLC_B3DLC2_SIZE                                  0x1
#define _B3DLC_B3DLC2_LENGTH                                0x1
#define _B3DLC_B3DLC2_MASK                                  0x4
#define _B3DLC_B3DLC3_POSN                                  0x3
#define _B3DLC_B3DLC3_POSITION                              0x3
#define _B3DLC_B3DLC3_SIZE                                  0x1
#define _B3DLC_B3DLC3_LENGTH                                0x1
#define _B3DLC_B3DLC3_MASK                                  0x8
#define _B3DLC_B3RB0_POSN                                   0x4
#define _B3DLC_B3RB0_POSITION                               0x4
#define _B3DLC_B3RB0_SIZE                                   0x1
#define _B3DLC_B3RB0_LENGTH                                 0x1
#define _B3DLC_B3RB0_MASK                                   0x10
#define _B3DLC_B3RB1_POSN                                   0x5
#define _B3DLC_B3RB1_POSITION                               0x5
#define _B3DLC_B3RB1_SIZE                                   0x1
#define _B3DLC_B3RB1_LENGTH                                 0x1
#define _B3DLC_B3RB1_MASK                                   0x20
#define _B3DLC_B3RXRTR_POSN                                 0x6
#define _B3DLC_B3RXRTR_POSITION                             0x6
#define _B3DLC_B3RXRTR_SIZE                                 0x1
#define _B3DLC_B3RXRTR_LENGTH                               0x1
#define _B3DLC_B3RXRTR_MASK                                 0x40

// Register: B3D0
#define B3D0 B3D0
extern volatile unsigned char           B3D0                __at(0xE56);
#ifndef _LIB_BUILD
asm("B3D0 equ 0E56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D00                  :1;
        unsigned B3D01                  :1;
        unsigned B3D02                  :1;
        unsigned B3D03                  :1;
        unsigned B3D04                  :1;
        unsigned B3D05                  :1;
        unsigned B3D06                  :1;
        unsigned B3D07                  :1;
    };
} B3D0bits_t;
extern volatile B3D0bits_t B3D0bits __at(0xE56);
// bitfield macros
#define _B3D0_B3D00_POSN                                    0x0
#define _B3D0_B3D00_POSITION                                0x0
#define _B3D0_B3D00_SIZE                                    0x1
#define _B3D0_B3D00_LENGTH                                  0x1
#define _B3D0_B3D00_MASK                                    0x1
#define _B3D0_B3D01_POSN                                    0x1
#define _B3D0_B3D01_POSITION                                0x1
#define _B3D0_B3D01_SIZE                                    0x1
#define _B3D0_B3D01_LENGTH                                  0x1
#define _B3D0_B3D01_MASK                                    0x2
#define _B3D0_B3D02_POSN                                    0x2
#define _B3D0_B3D02_POSITION                                0x2
#define _B3D0_B3D02_SIZE                                    0x1
#define _B3D0_B3D02_LENGTH                                  0x1
#define _B3D0_B3D02_MASK                                    0x4
#define _B3D0_B3D03_POSN                                    0x3
#define _B3D0_B3D03_POSITION                                0x3
#define _B3D0_B3D03_SIZE                                    0x1
#define _B3D0_B3D03_LENGTH                                  0x1
#define _B3D0_B3D03_MASK                                    0x8
#define _B3D0_B3D04_POSN                                    0x4
#define _B3D0_B3D04_POSITION                                0x4
#define _B3D0_B3D04_SIZE                                    0x1
#define _B3D0_B3D04_LENGTH                                  0x1
#define _B3D0_B3D04_MASK                                    0x10
#define _B3D0_B3D05_POSN                                    0x5
#define _B3D0_B3D05_POSITION                                0x5
#define _B3D0_B3D05_SIZE                                    0x1
#define _B3D0_B3D05_LENGTH                                  0x1
#define _B3D0_B3D05_MASK                                    0x20
#define _B3D0_B3D06_POSN                                    0x6
#define _B3D0_B3D06_POSITION                                0x6
#define _B3D0_B3D06_SIZE                                    0x1
#define _B3D0_B3D06_LENGTH                                  0x1
#define _B3D0_B3D06_MASK                                    0x40
#define _B3D0_B3D07_POSN                                    0x7
#define _B3D0_B3D07_POSITION                                0x7
#define _B3D0_B3D07_SIZE                                    0x1
#define _B3D0_B3D07_LENGTH                                  0x1
#define _B3D0_B3D07_MASK                                    0x80

