MikroElektronika/core_packages/PIC/XC8/def/PIC18F2480/mcu.h
#define                                 F10BP_1_bit         _BIT_ACCESS(RXFBCON5,1)
// RXFBCON5<F10BP_2>
extern volatile __bit                   F10BP_2             __at(0x6F2A);	// @ (0xDE5 * 8 + 2)
#define                                 F10BP_2_bit         _BIT_ACCESS(RXFBCON5,2)
// RXFBCON5<F10BP_3>
extern volatile __bit                   F10BP_3             __at(0x6F2B);	// @ (0xDE5 * 8 + 3)
#define                                 F10BP_3_bit         _BIT_ACCESS(RXFBCON5,3)
// RXFBCON5<F11BP_0>
extern volatile __bit                   F11BP_0             __at(0x6F2C);	// @ (0xDE5 * 8 + 4)
#define                                 F11BP_0_bit         _BIT_ACCESS(RXFBCON5,4)
// RXFBCON5<F11BP_1>
extern volatile __bit                   F11BP_1             __at(0x6F2D);	// @ (0xDE5 * 8 + 5)
#define                                 F11BP_1_bit         _BIT_ACCESS(RXFBCON5,5)
// RXFBCON5<F11BP_2>
extern volatile __bit                   F11BP_2             __at(0x6F2E);	// @ (0xDE5 * 8 + 6)
#define                                 F11BP_2_bit         _BIT_ACCESS(RXFBCON5,6)
// RXFBCON5<F11BP_3>
extern volatile __bit                   F11BP_3             __at(0x6F2F);	// @ (0xDE5 * 8 + 7)
#define                                 F11BP_3_bit         _BIT_ACCESS(RXFBCON5,7)
// RXFBCON6<F12BP_0>
extern volatile __bit                   F12BP_0             __at(0x6F30);	// @ (0xDE6 * 8 + 0)
#define                                 F12BP_0_bit         _BIT_ACCESS(RXFBCON6,0)
// RXFBCON6<F12BP_01>
extern volatile __bit                   F12BP_01            __at(0x6F30);	// @ (0xDE6 * 8 + 0)
#define                                 F12BP_01_bit        _BIT_ACCESS(RXFBCON6,0)
// RXFBCON6<F12BP_1>
extern volatile __bit                   F12BP_1             __at(0x6F31);	// @ (0xDE6 * 8 + 1)
#define                                 F12BP_1_bit         _BIT_ACCESS(RXFBCON6,1)
// RXFBCON6<F12BP_2>
extern volatile __bit                   F12BP_2             __at(0x6F32);	// @ (0xDE6 * 8 + 2)
#define                                 F12BP_2_bit         _BIT_ACCESS(RXFBCON6,2)
// RXFBCON6<F12BP_3>
extern volatile __bit                   F12BP_3             __at(0x6F33);	// @ (0xDE6 * 8 + 3)
#define                                 F12BP_3_bit         _BIT_ACCESS(RXFBCON6,3)
// RXFBCON6<F13BP_0>
extern volatile __bit                   F13BP_0             __at(0x6F34);	// @ (0xDE6 * 8 + 4)
#define                                 F13BP_0_bit         _BIT_ACCESS(RXFBCON6,4)
// RXFBCON6<F13BP_1>
extern volatile __bit                   F13BP_1             __at(0x6F35);	// @ (0xDE6 * 8 + 5)
#define                                 F13BP_1_bit         _BIT_ACCESS(RXFBCON6,5)
// RXFBCON6<F13BP_2>
extern volatile __bit                   F13BP_2             __at(0x6F36);	// @ (0xDE6 * 8 + 6)
#define                                 F13BP_2_bit         _BIT_ACCESS(RXFBCON6,6)
// RXFBCON6<F13BP_3>
extern volatile __bit                   F13BP_3             __at(0x6F37);	// @ (0xDE6 * 8 + 7)
#define                                 F13BP_3_bit         _BIT_ACCESS(RXFBCON6,7)
// RXFBCON7<F14BP_0>
extern volatile __bit                   F14BP_0             __at(0x6F38);	// @ (0xDE7 * 8 + 0)
#define                                 F14BP_0_bit         _BIT_ACCESS(RXFBCON7,0)
// RXFBCON7<F14BP_01>
extern volatile __bit                   F14BP_01            __at(0x6F38);	// @ (0xDE7 * 8 + 0)
#define                                 F14BP_01_bit        _BIT_ACCESS(RXFBCON7,0)
// RXFBCON7<F14BP_1>
extern volatile __bit                   F14BP_1             __at(0x6F39);	// @ (0xDE7 * 8 + 1)
#define                                 F14BP_1_bit         _BIT_ACCESS(RXFBCON7,1)
// RXFBCON7<F14BP_2>
extern volatile __bit                   F14BP_2             __at(0x6F3A);	// @ (0xDE7 * 8 + 2)
#define                                 F14BP_2_bit         _BIT_ACCESS(RXFBCON7,2)
// RXFBCON7<F14BP_3>
extern volatile __bit                   F14BP_3             __at(0x6F3B);	// @ (0xDE7 * 8 + 3)
#define                                 F14BP_3_bit         _BIT_ACCESS(RXFBCON7,3)
// RXFBCON7<F15BP_0>
extern volatile __bit                   F15BP_0             __at(0x6F3C);	// @ (0xDE7 * 8 + 4)
#define                                 F15BP_0_bit         _BIT_ACCESS(RXFBCON7,4)
// RXFBCON7<F15BP_1>
extern volatile __bit                   F15BP_1             __at(0x6F3D);	// @ (0xDE7 * 8 + 5)
#define                                 F15BP_1_bit         _BIT_ACCESS(RXFBCON7,5)
// RXFBCON7<F15BP_2>
extern volatile __bit                   F15BP_2             __at(0x6F3E);	// @ (0xDE7 * 8 + 6)
#define                                 F15BP_2_bit         _BIT_ACCESS(RXFBCON7,6)
// RXFBCON7<F15BP_3>
extern volatile __bit                   F15BP_3             __at(0x6F3F);	// @ (0xDE7 * 8 + 7)
#define                                 F15BP_3_bit         _BIT_ACCESS(RXFBCON7,7)
// RXFBCON0<F1BP_0>
extern volatile __bit                   F1BP_0              __at(0x6F04);	// @ (0xDE0 * 8 + 4)
#define                                 F1BP_0_bit          _BIT_ACCESS(RXFBCON0,4)
// RXFBCON0<F1BP_1>
extern volatile __bit                   F1BP_1              __at(0x6F05);	// @ (0xDE0 * 8 + 5)
#define                                 F1BP_1_bit          _BIT_ACCESS(RXFBCON0,5)
// RXFBCON0<F1BP_2>
extern volatile __bit                   F1BP_2              __at(0x6F06);	// @ (0xDE0 * 8 + 6)
#define                                 F1BP_2_bit          _BIT_ACCESS(RXFBCON0,6)
// RXFBCON0<F1BP_3>
extern volatile __bit                   F1BP_3              __at(0x6F07);	// @ (0xDE0 * 8 + 7)
#define                                 F1BP_3_bit          _BIT_ACCESS(RXFBCON0,7)
// RXFBCON1<F2BP_0>
extern volatile __bit                   F2BP_0              __at(0x6F08);	// @ (0xDE1 * 8 + 0)
#define                                 F2BP_0_bit          _BIT_ACCESS(RXFBCON1,0)
// RXFBCON1<F2BP_01>
extern volatile __bit                   F2BP_01             __at(0x6F08);	// @ (0xDE1 * 8 + 0)
#define                                 F2BP_01_bit         _BIT_ACCESS(RXFBCON1,0)
// RXFBCON1<F2BP_1>
extern volatile __bit                   F2BP_1              __at(0x6F09);	// @ (0xDE1 * 8 + 1)
#define                                 F2BP_1_bit          _BIT_ACCESS(RXFBCON1,1)
// RXFBCON1<F2BP_2>
extern volatile __bit                   F2BP_2              __at(0x6F0A);	// @ (0xDE1 * 8 + 2)
#define                                 F2BP_2_bit          _BIT_ACCESS(RXFBCON1,2)
// RXFBCON1<F2BP_3>
extern volatile __bit                   F2BP_3              __at(0x6F0B);	// @ (0xDE1 * 8 + 3)
#define                                 F2BP_3_bit          _BIT_ACCESS(RXFBCON1,3)
// RXFBCON1<F3BP_0>
extern volatile __bit                   F3BP_0              __at(0x6F0C);	// @ (0xDE1 * 8 + 4)
#define                                 F3BP_0_bit          _BIT_ACCESS(RXFBCON1,4)
// RXFBCON1<F3BP_1>
extern volatile __bit                   F3BP_1              __at(0x6F0D);	// @ (0xDE1 * 8 + 5)
#define                                 F3BP_1_bit          _BIT_ACCESS(RXFBCON1,5)
// RXFBCON1<F3BP_2>
extern volatile __bit                   F3BP_2              __at(0x6F0E);	// @ (0xDE1 * 8 + 6)
#define                                 F3BP_2_bit          _BIT_ACCESS(RXFBCON1,6)
// RXFBCON1<F3BP_3>
extern volatile __bit                   F3BP_3              __at(0x6F0F);	// @ (0xDE1 * 8 + 7)
#define                                 F3BP_3_bit          _BIT_ACCESS(RXFBCON1,7)
// RXFBCON2<F4BP_0>
extern volatile __bit                   F4BP_0              __at(0x6F10);	// @ (0xDE2 * 8 + 0)
#define                                 F4BP_0_bit          _BIT_ACCESS(RXFBCON2,0)
// RXFBCON2<F4BP_01>
extern volatile __bit                   F4BP_01             __at(0x6F10);	// @ (0xDE2 * 8 + 0)
#define                                 F4BP_01_bit         _BIT_ACCESS(RXFBCON2,0)
// RXFBCON2<F4BP_1>
extern volatile __bit                   F4BP_1              __at(0x6F11);	// @ (0xDE2 * 8 + 1)
#define                                 F4BP_1_bit          _BIT_ACCESS(RXFBCON2,1)
// RXFBCON2<F4BP_2>
extern volatile __bit                   F4BP_2              __at(0x6F12);	// @ (0xDE2 * 8 + 2)
#define                                 F4BP_2_bit          _BIT_ACCESS(RXFBCON2,2)
// RXFBCON2<F4BP_3>
extern volatile __bit                   F4BP_3              __at(0x6F13);	// @ (0xDE2 * 8 + 3)
#define                                 F4BP_3_bit          _BIT_ACCESS(RXFBCON2,3)
// RXFBCON2<F5BP_0>
extern volatile __bit                   F5BP_0              __at(0x6F14);	// @ (0xDE2 * 8 + 4)
#define                                 F5BP_0_bit          _BIT_ACCESS(RXFBCON2,4)
// RXFBCON2<F5BP_1>
extern volatile __bit                   F5BP_1              __at(0x6F15);	// @ (0xDE2 * 8 + 5)
#define                                 F5BP_1_bit          _BIT_ACCESS(RXFBCON2,5)
// RXFBCON2<F5BP_2>
extern volatile __bit                   F5BP_2              __at(0x6F16);	// @ (0xDE2 * 8 + 6)
#define                                 F5BP_2_bit          _BIT_ACCESS(RXFBCON2,6)
// RXFBCON2<F5BP_3>
extern volatile __bit                   F5BP_3              __at(0x6F17);	// @ (0xDE2 * 8 + 7)
#define                                 F5BP_3_bit          _BIT_ACCESS(RXFBCON2,7)
// RXFBCON3<F6BP_0>
extern volatile __bit                   F6BP_0              __at(0x6F18);	// @ (0xDE3 * 8 + 0)
#define                                 F6BP_0_bit          _BIT_ACCESS(RXFBCON3,0)
// RXFBCON3<F6BP_01>
extern volatile __bit                   F6BP_01             __at(0x6F18);	// @ (0xDE3 * 8 + 0)
#define                                 F6BP_01_bit         _BIT_ACCESS(RXFBCON3,0)
// RXFBCON3<F6BP_1>
extern volatile __bit                   F6BP_1              __at(0x6F19);	// @ (0xDE3 * 8 + 1)
#define                                 F6BP_1_bit          _BIT_ACCESS(RXFBCON3,1)
// RXFBCON3<F6BP_2>
extern volatile __bit                   F6BP_2              __at(0x6F1A);	// @ (0xDE3 * 8 + 2)
#define                                 F6BP_2_bit          _BIT_ACCESS(RXFBCON3,2)
// RXFBCON3<F6BP_3>
extern volatile __bit                   F6BP_3              __at(0x6F1B);	// @ (0xDE3 * 8 + 3)
#define                                 F6BP_3_bit          _BIT_ACCESS(RXFBCON3,3)
// RXFBCON3<F7BP_0>
extern volatile __bit                   F7BP_0              __at(0x6F1C);	// @ (0xDE3 * 8 + 4)
#define                                 F7BP_0_bit          _BIT_ACCESS(RXFBCON3,4)
// RXFBCON3<F7BP_1>
extern volatile __bit                   F7BP_1              __at(0x6F1D);	// @ (0xDE3 * 8 + 5)
#define                                 F7BP_1_bit          _BIT_ACCESS(RXFBCON3,5)
// RXFBCON3<F7BP_2>
extern volatile __bit                   F7BP_2              __at(0x6F1E);	// @ (0xDE3 * 8 + 6)
#define                                 F7BP_2_bit          _BIT_ACCESS(RXFBCON3,6)
// RXFBCON3<F7BP_3>
extern volatile __bit                   F7BP_3              __at(0x6F1F);	// @ (0xDE3 * 8 + 7)
#define                                 F7BP_3_bit          _BIT_ACCESS(RXFBCON3,7)
// RXFBCON4<F8BP_0>
extern volatile __bit                   F8BP_0              __at(0x6F20);	// @ (0xDE4 * 8 + 0)
#define                                 F8BP_0_bit          _BIT_ACCESS(RXFBCON4,0)
// RXFBCON4<F8BP_01>
extern volatile __bit                   F8BP_01             __at(0x6F20);	// @ (0xDE4 * 8 + 0)
#define                                 F8BP_01_bit         _BIT_ACCESS(RXFBCON4,0)
// RXFBCON4<F8BP_1>
extern volatile __bit                   F8BP_1              __at(0x6F21);	// @ (0xDE4 * 8 + 1)
#define                                 F8BP_1_bit          _BIT_ACCESS(RXFBCON4,1)
// RXFBCON4<F8BP_2>
extern volatile __bit                   F8BP_2              __at(0x6F22);	// @ (0xDE4 * 8 + 2)
#define                                 F8BP_2_bit          _BIT_ACCESS(RXFBCON4,2)
// RXFBCON4<F8BP_3>
extern volatile __bit                   F8BP_3              __at(0x6F23);	// @ (0xDE4 * 8 + 3)
#define                                 F8BP_3_bit          _BIT_ACCESS(RXFBCON4,3)
// RXFBCON4<F9BP_0>
extern volatile __bit                   F9BP_0              __at(0x6F24);	// @ (0xDE4 * 8 + 4)
#define                                 F9BP_0_bit          _BIT_ACCESS(RXFBCON4,4)
// RXFBCON4<F9BP_1>
extern volatile __bit                   F9BP_1              __at(0x6F25);	// @ (0xDE4 * 8 + 5)
#define                                 F9BP_1_bit          _BIT_ACCESS(RXFBCON4,5)
// RXFBCON4<F9BP_2>
extern volatile __bit                   F9BP_2              __at(0x6F26);	// @ (0xDE4 * 8 + 6)
#define                                 F9BP_2_bit          _BIT_ACCESS(RXFBCON4,6)
// RXFBCON4<F9BP_3>
extern volatile __bit                   F9BP_3              __at(0x6F27);	// @ (0xDE4 * 8 + 7)
#define                                 F9BP_3_bit          _BIT_ACCESS(RXFBCON4,7)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// COMSTAT<FIFOEMPTY>
extern volatile __bit                   FIFOEMPTY           __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 FIFOEMPTY_bit       _BIT_ACCESS(COMSTAT,7)
// PIE3<FIFOMWIE>
extern volatile __bit                   FIFOMWIE            __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 FIFOMWIE_bit        _BIT_ACCESS(PIE3,0)
// ECANCON<FIFOWM>
extern volatile __bit                   FIFOWM              __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 FIFOWM_bit          _BIT_ACCESS(ECANCON,5)
// PIE3<FIFOWMIE>
extern volatile __bit                   FIFOWMIE            __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 FIFOWMIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<FIFOWMIF>
extern volatile __bit                   FIFOWMIF            __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 FIFOWMIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<FIFOWMIP>
extern volatile __bit                   FIFOWMIP            __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 FIFOWMIP_bit        _BIT_ACCESS(IPR3,0)
// MSEL0<FIL0_0>
extern volatile __bit                   FIL0_0              __at(0x6F80);	// @ (0xDF0 * 8 + 0)
#define                                 FIL0_0_bit          _BIT_ACCESS(MSEL0,0)
// MSEL0<FIL0_1>
extern volatile __bit                   FIL0_1              __at(0x6F81);	// @ (0xDF0 * 8 + 1)
#define                                 FIL0_1_bit          _BIT_ACCESS(MSEL0,1)
// MSEL2<FIL10_0>
extern volatile __bit                   FIL10_0             __at(0x6F94);	// @ (0xDF2 * 8 + 4)
#define                                 FIL10_0_bit         _BIT_ACCESS(MSEL2,4)
// MSEL2<FIL10_1>
extern volatile __bit                   FIL10_1             __at(0x6F95);	// @ (0xDF2 * 8 + 5)
#define                                 FIL10_1_bit         _BIT_ACCESS(MSEL2,5)
// MSEL2<FIL11_0>
extern volatile __bit                   FIL11_0             __at(0x6F96);	// @ (0xDF2 * 8 + 6)
#define                                 FIL11_0_bit         _BIT_ACCESS(MSEL2,6)
// MSEL2<FIL11_1>
extern volatile __bit                   FIL11_1             __at(0x6F97);	// @ (0xDF2 * 8 + 7)
#define                                 FIL11_1_bit         _BIT_ACCESS(MSEL2,7)
// MSEL3<FIL12_0>
extern volatile __bit                   FIL12_0             __at(0x6F98);	// @ (0xDF3 * 8 + 0)
#define                                 FIL12_0_bit         _BIT_ACCESS(MSEL3,0)
// MSEL3<FIL12_1>
extern volatile __bit                   FIL12_1             __at(0x6F99);	// @ (0xDF3 * 8 + 1)
#define                                 FIL12_1_bit         _BIT_ACCESS(MSEL3,1)
// MSEL3<FIL13_0>
extern volatile __bit                   FIL13_0             __at(0x6F9A);	// @ (0xDF3 * 8 + 2)
#define                                 FIL13_0_bit         _BIT_ACCESS(MSEL3,2)
// MSEL3<FIL13_1>
extern volatile __bit                   FIL13_1             __at(0x6F9B);	// @ (0xDF3 * 8 + 3)
#define                                 FIL13_1_bit         _BIT_ACCESS(MSEL3,3)
// MSEL3<FIL14_0>
extern volatile __bit                   FIL14_0             __at(0x6F9C);	// @ (0xDF3 * 8 + 4)
#define                                 FIL14_0_bit         _BIT_ACCESS(MSEL3,4)
// MSEL3<FIL14_1>
extern volatile __bit                   FIL14_1             __at(0x6F9D);	// @ (0xDF3 * 8 + 5)
#define                                 FIL14_1_bit         _BIT_ACCESS(MSEL3,5)
// MSEL3<FIL15_0>
extern volatile __bit                   FIL15_0             __at(0x6F9E);	// @ (0xDF3 * 8 + 6)
#define                                 FIL15_0_bit         _BIT_ACCESS(MSEL3,6)
// MSEL3<FIL15_1>
extern volatile __bit                   FIL15_1             __at(0x6F9F);	// @ (0xDF3 * 8 + 7)
#define                                 FIL15_1_bit         _BIT_ACCESS(MSEL3,7)
// MSEL0<FIL1_0>
extern volatile __bit                   FIL1_0              __at(0x6F82);	// @ (0xDF0 * 8 + 2)
#define                                 FIL1_0_bit          _BIT_ACCESS(MSEL0,2)
// MSEL0<FIL1_1>
extern volatile __bit                   FIL1_1              __at(0x6F83);	// @ (0xDF0 * 8 + 3)
#define                                 FIL1_1_bit          _BIT_ACCESS(MSEL0,3)
// MSEL0<FIL2_0>
extern volatile __bit                   FIL2_0              __at(0x6F84);	// @ (0xDF0 * 8 + 4)
#define                                 FIL2_0_bit          _BIT_ACCESS(MSEL0,4)
// MSEL0<FIL2_1>
extern volatile __bit                   FIL2_1              __at(0x6F85);	// @ (0xDF0 * 8 + 5)
#define                                 FIL2_1_bit          _BIT_ACCESS(MSEL0,5)
// MSEL0<FIL3_0>
extern volatile __bit                   FIL3_0              __at(0x6F86);	// @ (0xDF0 * 8 + 6)
#define                                 FIL3_0_bit          _BIT_ACCESS(MSEL0,6)
// MSEL0<FIL3_1>
extern volatile __bit                   FIL3_1              __at(0x6F87);	// @ (0xDF0 * 8 + 7)
#define                                 FIL3_1_bit          _BIT_ACCESS(MSEL0,7)
// MSEL1<FIL4_0>
extern volatile __bit                   FIL4_0              __at(0x6F88);	// @ (0xDF1 * 8 + 0)
#define                                 FIL4_0_bit          _BIT_ACCESS(MSEL1,0)
// MSEL1<FIL4_1>
extern volatile __bit                   FIL4_1              __at(0x6F89);	// @ (0xDF1 * 8 + 1)
#define                                 FIL4_1_bit          _BIT_ACCESS(MSEL1,1)
// MSEL1<FIL5_0>
extern volatile __bit                   FIL5_0              __at(0x6F8A);	// @ (0xDF1 * 8 + 2)
#define                                 FIL5_0_bit          _BIT_ACCESS(MSEL1,2)
// MSEL1<FIL5_1>
extern volatile __bit                   FIL5_1              __at(0x6F8B);	// @ (0xDF1 * 8 + 3)
#define                                 FIL5_1_bit          _BIT_ACCESS(MSEL1,3)
// MSEL1<FIL6_0>
extern volatile __bit                   FIL6_0              __at(0x6F8C);	// @ (0xDF1 * 8 + 4)
#define                                 FIL6_0_bit          _BIT_ACCESS(MSEL1,4)
// MSEL1<FIL6_1>
extern volatile __bit                   FIL6_1              __at(0x6F8D);	// @ (0xDF1 * 8 + 5)
#define                                 FIL6_1_bit          _BIT_ACCESS(MSEL1,5)
// MSEL1<FIL7_0>
extern volatile __bit                   FIL7_0              __at(0x6F8E);	// @ (0xDF1 * 8 + 6)
#define                                 FIL7_0_bit          _BIT_ACCESS(MSEL1,6)
// MSEL1<FIL7_1>
extern volatile __bit                   FIL7_1              __at(0x6F8F);	// @ (0xDF1 * 8 + 7)
#define                                 FIL7_1_bit          _BIT_ACCESS(MSEL1,7)
// MSEL2<FIL8_0>
extern volatile __bit                   FIL8_0              __at(0x6F90);	// @ (0xDF2 * 8 + 0)
#define                                 FIL8_0_bit          _BIT_ACCESS(MSEL2,0)
// MSEL2<FIL8_1>
extern volatile __bit                   FIL8_1              __at(0x6F91);	// @ (0xDF2 * 8 + 1)
#define                                 FIL8_1_bit          _BIT_ACCESS(MSEL2,1)
// MSEL2<FIL9_0>
extern volatile __bit                   FIL9_0              __at(0x6F92);	// @ (0xDF2 * 8 + 2)
#define                                 FIL9_0_bit          _BIT_ACCESS(MSEL2,2)
// MSEL2<FIL9_1>
extern volatile __bit                   FIL9_1              __at(0x6F93);	// @ (0xDF2 * 8 + 3)
#define                                 FIL9_1_bit          _BIT_ACCESS(MSEL2,3)
// SDFLC<FLC0>
extern volatile __bit                   FLC0                __at(0x6EC0);	// @ (0xDD8 * 8 + 0)
#define                                 FLC0_bit            _BIT_ACCESS(SDFLC,0)
// SDFLC<FLC1>
extern volatile __bit                   FLC1                __at(0x6EC1);	// @ (0xDD8 * 8 + 1)
#define                                 FLC1_bit            _BIT_ACCESS(SDFLC,1)
// SDFLC<FLC2>
extern volatile __bit                   FLC2                __at(0x6EC2);	// @ (0xDD8 * 8 + 2)
#define                                 FLC2_bit            _BIT_ACCESS(SDFLC,2)
// SDFLC<FLC3>
extern volatile __bit                   FLC3                __at(0x6EC3);	// @ (0xDD8 * 8 + 3)
#define                                 FLC3_bit            _BIT_ACCESS(SDFLC,3)
// SDFLC<FLC4>
extern volatile __bit                   FLC4                __at(0x6EC4);	// @ (0xDD8 * 8 + 4)
#define                                 FLC4_bit            _BIT_ACCESS(SDFLC,4)
// PORTB<FLT0>
extern volatile __bit                   FLT0                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 FLT0_bit            _BIT_ACCESS(PORTB,0)
// CANCON<FP0>
extern volatile __bit _DEPRECATED       FP0                 __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 FP0_bit             _BIT_ACCESS(CANCON,0)
// CANCON<FP1>
extern volatile __bit                   FP1                 __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 FP1_bit             _BIT_ACCESS(CANCON,1)
// CANCON<FP2>
extern volatile __bit                   FP2                 __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 FP2_bit             _BIT_ACCESS(CANCON,2)
// CANCON<FP3>
extern volatile __bit                   FP3                 __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 FP3_bit             _BIT_ACCESS(CANCON,3)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// SSPCON2<GCEN>
extern volatile __bit                   GCEN                __at(0x7E2F);	// @ (0xFC5 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSPCON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GODONE>
extern volatile __bit                   GODONE              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GODONE_bit          _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0x7E11);	// @ (0xFC2 * 8 + 1)
