MikroElektronika/core_packages/PIC/XC8/def/PIC18F2480/mcu.h
extern volatile __bit                   TXB0D20             __at(0x7A40);	// @ (0xF48 * 8 + 0)
#define                                 TXB0D20_bit         _BIT_ACCESS(TXB0D2,0)
// TXB0D2<TXB0D21>
extern volatile __bit                   TXB0D21             __at(0x7A41);	// @ (0xF48 * 8 + 1)
#define                                 TXB0D21_bit         _BIT_ACCESS(TXB0D2,1)
// TXB0D2<TXB0D22>
extern volatile __bit                   TXB0D22             __at(0x7A42);	// @ (0xF48 * 8 + 2)
#define                                 TXB0D22_bit         _BIT_ACCESS(TXB0D2,2)
// TXB0D2<TXB0D23>
extern volatile __bit                   TXB0D23             __at(0x7A43);	// @ (0xF48 * 8 + 3)
#define                                 TXB0D23_bit         _BIT_ACCESS(TXB0D2,3)
// TXB0D2<TXB0D24>
extern volatile __bit                   TXB0D24             __at(0x7A44);	// @ (0xF48 * 8 + 4)
#define                                 TXB0D24_bit         _BIT_ACCESS(TXB0D2,4)
// TXB0D2<TXB0D25>
extern volatile __bit                   TXB0D25             __at(0x7A45);	// @ (0xF48 * 8 + 5)
#define                                 TXB0D25_bit         _BIT_ACCESS(TXB0D2,5)
// TXB0D2<TXB0D26>
extern volatile __bit                   TXB0D26             __at(0x7A46);	// @ (0xF48 * 8 + 6)
#define                                 TXB0D26_bit         _BIT_ACCESS(TXB0D2,6)
// TXB0D2<TXB0D27>
extern volatile __bit                   TXB0D27             __at(0x7A47);	// @ (0xF48 * 8 + 7)
#define                                 TXB0D27_bit         _BIT_ACCESS(TXB0D2,7)
// TXB0D3<TXB0D30>
extern volatile __bit                   TXB0D30             __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 TXB0D30_bit         _BIT_ACCESS(TXB0D3,0)
// TXB0D3<TXB0D31>
extern volatile __bit                   TXB0D31             __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 TXB0D31_bit         _BIT_ACCESS(TXB0D3,1)
// TXB0D3<TXB0D32>
extern volatile __bit                   TXB0D32             __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 TXB0D32_bit         _BIT_ACCESS(TXB0D3,2)
// TXB0D3<TXB0D33>
extern volatile __bit                   TXB0D33             __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 TXB0D33_bit         _BIT_ACCESS(TXB0D3,3)
// TXB0D3<TXB0D34>
extern volatile __bit                   TXB0D34             __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 TXB0D34_bit         _BIT_ACCESS(TXB0D3,4)
// TXB0D3<TXB0D35>
extern volatile __bit                   TXB0D35             __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 TXB0D35_bit         _BIT_ACCESS(TXB0D3,5)
// TXB0D3<TXB0D36>
extern volatile __bit                   TXB0D36             __at(0x7A4E);	// @ (0xF49 * 8 + 6)
#define                                 TXB0D36_bit         _BIT_ACCESS(TXB0D3,6)
// TXB0D3<TXB0D37>
extern volatile __bit                   TXB0D37             __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 TXB0D37_bit         _BIT_ACCESS(TXB0D3,7)
// TXB0D4<TXB0D40>
extern volatile __bit                   TXB0D40             __at(0x7A50);	// @ (0xF4A * 8 + 0)
#define                                 TXB0D40_bit         _BIT_ACCESS(TXB0D4,0)
// TXB0D4<TXB0D41>
extern volatile __bit                   TXB0D41             __at(0x7A51);	// @ (0xF4A * 8 + 1)
#define                                 TXB0D41_bit         _BIT_ACCESS(TXB0D4,1)
// TXB0D4<TXB0D42>
extern volatile __bit                   TXB0D42             __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 TXB0D42_bit         _BIT_ACCESS(TXB0D4,2)
// TXB0D4<TXB0D43>
extern volatile __bit                   TXB0D43             __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 TXB0D43_bit         _BIT_ACCESS(TXB0D4,3)
// TXB0D4<TXB0D44>
extern volatile __bit                   TXB0D44             __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 TXB0D44_bit         _BIT_ACCESS(TXB0D4,4)
// TXB0D4<TXB0D45>
extern volatile __bit                   TXB0D45             __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 TXB0D45_bit         _BIT_ACCESS(TXB0D4,5)
// TXB0D4<TXB0D46>
extern volatile __bit                   TXB0D46             __at(0x7A56);	// @ (0xF4A * 8 + 6)
#define                                 TXB0D46_bit         _BIT_ACCESS(TXB0D4,6)
// TXB0D4<TXB0D47>
extern volatile __bit                   TXB0D47             __at(0x7A57);	// @ (0xF4A * 8 + 7)
#define                                 TXB0D47_bit         _BIT_ACCESS(TXB0D4,7)
// TXB0D5<TXB0D50>
extern volatile __bit                   TXB0D50             __at(0x7A58);	// @ (0xF4B * 8 + 0)
#define                                 TXB0D50_bit         _BIT_ACCESS(TXB0D5,0)
// TXB0D5<TXB0D51>
extern volatile __bit                   TXB0D51             __at(0x7A59);	// @ (0xF4B * 8 + 1)
#define                                 TXB0D51_bit         _BIT_ACCESS(TXB0D5,1)
// TXB0D5<TXB0D52>
extern volatile __bit                   TXB0D52             __at(0x7A5A);	// @ (0xF4B * 8 + 2)
#define                                 TXB0D52_bit         _BIT_ACCESS(TXB0D5,2)
// TXB0D5<TXB0D53>
extern volatile __bit                   TXB0D53             __at(0x7A5B);	// @ (0xF4B * 8 + 3)
#define                                 TXB0D53_bit         _BIT_ACCESS(TXB0D5,3)
// TXB0D5<TXB0D54>
extern volatile __bit                   TXB0D54             __at(0x7A5C);	// @ (0xF4B * 8 + 4)
#define                                 TXB0D54_bit         _BIT_ACCESS(TXB0D5,4)
// TXB0D5<TXB0D55>
extern volatile __bit                   TXB0D55             __at(0x7A5D);	// @ (0xF4B * 8 + 5)
#define                                 TXB0D55_bit         _BIT_ACCESS(TXB0D5,5)
// TXB0D5<TXB0D56>
extern volatile __bit                   TXB0D56             __at(0x7A5E);	// @ (0xF4B * 8 + 6)
#define                                 TXB0D56_bit         _BIT_ACCESS(TXB0D5,6)
// TXB0D5<TXB0D57>
extern volatile __bit                   TXB0D57             __at(0x7A5F);	// @ (0xF4B * 8 + 7)
#define                                 TXB0D57_bit         _BIT_ACCESS(TXB0D5,7)
// TXB0D6<TXB0D60>
extern volatile __bit                   TXB0D60             __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 TXB0D60_bit         _BIT_ACCESS(TXB0D6,0)
// TXB0D6<TXB0D61>
extern volatile __bit                   TXB0D61             __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 TXB0D61_bit         _BIT_ACCESS(TXB0D6,1)
// TXB0D6<TXB0D62>
extern volatile __bit                   TXB0D62             __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 TXB0D62_bit         _BIT_ACCESS(TXB0D6,2)
// TXB0D6<TXB0D63>
extern volatile __bit                   TXB0D63             __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 TXB0D63_bit         _BIT_ACCESS(TXB0D6,3)
// TXB0D6<TXB0D64>
extern volatile __bit                   TXB0D64             __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 TXB0D64_bit         _BIT_ACCESS(TXB0D6,4)
// TXB0D6<TXB0D65>
extern volatile __bit                   TXB0D65             __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 TXB0D65_bit         _BIT_ACCESS(TXB0D6,5)
// TXB0D6<TXB0D66>
extern volatile __bit                   TXB0D66             __at(0x7A66);	// @ (0xF4C * 8 + 6)
#define                                 TXB0D66_bit         _BIT_ACCESS(TXB0D6,6)
// TXB0D6<TXB0D67>
extern volatile __bit                   TXB0D67             __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 TXB0D67_bit         _BIT_ACCESS(TXB0D6,7)
// TXB0D7<TXB0D70>
extern volatile __bit                   TXB0D70             __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 TXB0D70_bit         _BIT_ACCESS(TXB0D7,0)
// TXB0D7<TXB0D71>
extern volatile __bit                   TXB0D71             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 TXB0D71_bit         _BIT_ACCESS(TXB0D7,1)
// TXB0D7<TXB0D72>
extern volatile __bit                   TXB0D72             __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 TXB0D72_bit         _BIT_ACCESS(TXB0D7,2)
// TXB0D7<TXB0D73>
extern volatile __bit                   TXB0D73             __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 TXB0D73_bit         _BIT_ACCESS(TXB0D7,3)
// TXB0D7<TXB0D74>
extern volatile __bit                   TXB0D74             __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 TXB0D74_bit         _BIT_ACCESS(TXB0D7,4)
// TXB0D7<TXB0D75>
extern volatile __bit                   TXB0D75             __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 TXB0D75_bit         _BIT_ACCESS(TXB0D7,5)
// TXB0D7<TXB0D76>
extern volatile __bit                   TXB0D76             __at(0x7A6E);	// @ (0xF4D * 8 + 6)
#define                                 TXB0D76_bit         _BIT_ACCESS(TXB0D7,6)
// TXB0D7<TXB0D77>
extern volatile __bit                   TXB0D77             __at(0x7A6F);	// @ (0xF4D * 8 + 7)
#define                                 TXB0D77_bit         _BIT_ACCESS(TXB0D7,7)
// TXB0DLC<TXB0DLC0>
extern volatile __bit                   TXB0DLC0            __at(0x7A28);	// @ (0xF45 * 8 + 0)
#define                                 TXB0DLC0_bit        _BIT_ACCESS(TXB0DLC,0)
// TXB0DLC<TXB0DLC1>
extern volatile __bit                   TXB0DLC1            __at(0x7A29);	// @ (0xF45 * 8 + 1)
#define                                 TXB0DLC1_bit        _BIT_ACCESS(TXB0DLC,1)
// TXB0DLC<TXB0DLC2>
extern volatile __bit                   TXB0DLC2            __at(0x7A2A);	// @ (0xF45 * 8 + 2)
#define                                 TXB0DLC2_bit        _BIT_ACCESS(TXB0DLC,2)
// TXB0DLC<TXB0DLC3>
extern volatile __bit                   TXB0DLC3            __at(0x7A2B);	// @ (0xF45 * 8 + 3)
#define                                 TXB0DLC3_bit        _BIT_ACCESS(TXB0DLC,3)
// TXB0EIDL<TXB0EID0>
extern volatile __bit                   TXB0EID0            __at(0x7A20);	// @ (0xF44 * 8 + 0)
#define                                 TXB0EID0_bit        _BIT_ACCESS(TXB0EIDL,0)
// TXB0EIDL<TXB0EID1>
extern volatile __bit                   TXB0EID1            __at(0x7A21);	// @ (0xF44 * 8 + 1)
#define                                 TXB0EID1_bit        _BIT_ACCESS(TXB0EIDL,1)
// TXB0EIDH<TXB0EID10>
extern volatile __bit                   TXB0EID10           __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 TXB0EID10_bit       _BIT_ACCESS(TXB0EIDH,2)
// TXB0EIDH<TXB0EID11>
extern volatile __bit                   TXB0EID11           __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 TXB0EID11_bit       _BIT_ACCESS(TXB0EIDH,3)
// TXB0EIDH<TXB0EID12>
extern volatile __bit                   TXB0EID12           __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 TXB0EID12_bit       _BIT_ACCESS(TXB0EIDH,4)
// TXB0EIDH<TXB0EID13>
extern volatile __bit                   TXB0EID13           __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 TXB0EID13_bit       _BIT_ACCESS(TXB0EIDH,5)
// TXB0EIDH<TXB0EID14>
extern volatile __bit                   TXB0EID14           __at(0x7A1E);	// @ (0xF43 * 8 + 6)
#define                                 TXB0EID14_bit       _BIT_ACCESS(TXB0EIDH,6)
// TXB0EIDH<TXB0EID15>
extern volatile __bit                   TXB0EID15           __at(0x7A1F);	// @ (0xF43 * 8 + 7)
#define                                 TXB0EID15_bit       _BIT_ACCESS(TXB0EIDH,7)
// TXB0SIDL<TXB0EID16>
extern volatile __bit                   TXB0EID16           __at(0x7A10);	// @ (0xF42 * 8 + 0)
#define                                 TXB0EID16_bit       _BIT_ACCESS(TXB0SIDL,0)
// TXB0SIDL<TXB0EID17>
extern volatile __bit                   TXB0EID17           __at(0x7A11);	// @ (0xF42 * 8 + 1)
#define                                 TXB0EID17_bit       _BIT_ACCESS(TXB0SIDL,1)
// TXB0EIDL<TXB0EID2>
extern volatile __bit                   TXB0EID2            __at(0x7A22);	// @ (0xF44 * 8 + 2)
#define                                 TXB0EID2_bit        _BIT_ACCESS(TXB0EIDL,2)
// TXB0EIDL<TXB0EID3>
extern volatile __bit                   TXB0EID3            __at(0x7A23);	// @ (0xF44 * 8 + 3)
#define                                 TXB0EID3_bit        _BIT_ACCESS(TXB0EIDL,3)
// TXB0EIDL<TXB0EID4>
extern volatile __bit                   TXB0EID4            __at(0x7A24);	// @ (0xF44 * 8 + 4)
#define                                 TXB0EID4_bit        _BIT_ACCESS(TXB0EIDL,4)
// TXB0EIDL<TXB0EID5>
extern volatile __bit                   TXB0EID5            __at(0x7A25);	// @ (0xF44 * 8 + 5)
#define                                 TXB0EID5_bit        _BIT_ACCESS(TXB0EIDL,5)
// TXB0EIDL<TXB0EID6>
extern volatile __bit                   TXB0EID6            __at(0x7A26);	// @ (0xF44 * 8 + 6)
#define                                 TXB0EID6_bit        _BIT_ACCESS(TXB0EIDL,6)
// TXB0EIDL<TXB0EID7>
extern volatile __bit                   TXB0EID7            __at(0x7A27);	// @ (0xF44 * 8 + 7)
#define                                 TXB0EID7_bit        _BIT_ACCESS(TXB0EIDL,7)
// TXB0EIDH<TXB0EID8>
extern volatile __bit                   TXB0EID8            __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 TXB0EID8_bit        _BIT_ACCESS(TXB0EIDH,0)
// TXB0EIDH<TXB0EID9>
extern volatile __bit                   TXB0EID9            __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 TXB0EID9_bit        _BIT_ACCESS(TXB0EIDH,1)
// TXB0CON<TXB0ERR>
extern volatile __bit                   TXB0ERR             __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 TXB0ERR_bit         _BIT_ACCESS(TXB0CON,4)
// TXB0SIDL<TXB0EXIDE>
extern volatile __bit                   TXB0EXIDE           __at(0x7A13);	// @ (0xF42 * 8 + 3)
#define                                 TXB0EXIDE_bit       _BIT_ACCESS(TXB0SIDL,3)
// PIE3<TXB0IE>
extern volatile __bit _DEPRECATED       TXB0IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 TXB0IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<TXB0IF>
extern volatile __bit                   TXB0IF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 TXB0IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<TXB0IP>
extern volatile __bit                   TXB0IP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 TXB0IP_bit          _BIT_ACCESS(IPR3,2)
// TXB0CON<TXB0LARB>
extern volatile __bit                   TXB0LARB            __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 TXB0LARB_bit        _BIT_ACCESS(TXB0CON,5)
// TXB0CON<TXB0PRI0>
extern volatile __bit                   TXB0PRI0            __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 TXB0PRI0_bit        _BIT_ACCESS(TXB0CON,0)
// TXB0CON<TXB0PRI1>
extern volatile __bit                   TXB0PRI1            __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 TXB0PRI1_bit        _BIT_ACCESS(TXB0CON,1)
// TXB0CON<TXB0REQ>
extern volatile __bit                   TXB0REQ             __at(0x7A03);	// @ (0xF40 * 8 + 3)
#define                                 TXB0REQ_bit         _BIT_ACCESS(TXB0CON,3)
// TXB0DLC<TXB0RTR>
extern volatile __bit                   TXB0RTR             __at(0x7A2E);	// @ (0xF45 * 8 + 6)
#define                                 TXB0RTR_bit         _BIT_ACCESS(TXB0DLC,6)
// TXB0SIDL<TXB0SID0>
extern volatile __bit                   TXB0SID0            __at(0x7A15);	// @ (0xF42 * 8 + 5)
#define                                 TXB0SID0_bit        _BIT_ACCESS(TXB0SIDL,5)
// TXB0SIDL<TXB0SID1>
extern volatile __bit                   TXB0SID1            __at(0x7A16);	// @ (0xF42 * 8 + 6)
#define                                 TXB0SID1_bit        _BIT_ACCESS(TXB0SIDL,6)
// TXB0SIDH<TXB0SID10>
extern volatile __bit                   TXB0SID10           __at(0x7A0F);	// @ (0xF41 * 8 + 7)
#define                                 TXB0SID10_bit       _BIT_ACCESS(TXB0SIDH,7)
// TXB0SIDL<TXB0SID2>
extern volatile __bit                   TXB0SID2            __at(0x7A17);	// @ (0xF42 * 8 + 7)
#define                                 TXB0SID2_bit        _BIT_ACCESS(TXB0SIDL,7)
// TXB0SIDH<TXB0SID3>
extern volatile __bit                   TXB0SID3            __at(0x7A08);	// @ (0xF41 * 8 + 0)
#define                                 TXB0SID3_bit        _BIT_ACCESS(TXB0SIDH,0)
// TXB0SIDH<TXB0SID4>
extern volatile __bit                   TXB0SID4            __at(0x7A09);	// @ (0xF41 * 8 + 1)
#define                                 TXB0SID4_bit        _BIT_ACCESS(TXB0SIDH,1)
// TXB0SIDH<TXB0SID5>
extern volatile __bit                   TXB0SID5            __at(0x7A0A);	// @ (0xF41 * 8 + 2)
#define                                 TXB0SID5_bit        _BIT_ACCESS(TXB0SIDH,2)
// TXB0SIDH<TXB0SID6>
extern volatile __bit                   TXB0SID6            __at(0x7A0B);	// @ (0xF41 * 8 + 3)
#define                                 TXB0SID6_bit        _BIT_ACCESS(TXB0SIDH,3)
// TXB0SIDH<TXB0SID7>
extern volatile __bit                   TXB0SID7            __at(0x7A0C);	// @ (0xF41 * 8 + 4)
#define                                 TXB0SID7_bit        _BIT_ACCESS(TXB0SIDH,4)
// TXB0SIDH<TXB0SID8>
extern volatile __bit                   TXB0SID8            __at(0x7A0D);	// @ (0xF41 * 8 + 5)
#define                                 TXB0SID8_bit        _BIT_ACCESS(TXB0SIDH,5)
// TXB0SIDH<TXB0SID9>
extern volatile __bit                   TXB0SID9            __at(0x7A0E);	// @ (0xF41 * 8 + 6)
#define                                 TXB0SID9_bit        _BIT_ACCESS(TXB0SIDH,6)
// TXB1CON<TXB1ABT>
extern volatile __bit                   TXB1ABT             __at(0x7986);	// @ (0xF30 * 8 + 6)
#define                                 TXB1ABT_bit         _BIT_ACCESS(TXB1CON,6)
// TXB1D0<TXB1D00>
extern volatile __bit                   TXB1D00             __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 TXB1D00_bit         _BIT_ACCESS(TXB1D0,0)
// TXB1D0<TXB1D01>
extern volatile __bit                   TXB1D01             __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 TXB1D01_bit         _BIT_ACCESS(TXB1D0,1)
// TXB1D0<TXB1D02>
extern volatile __bit                   TXB1D02             __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 TXB1D02_bit         _BIT_ACCESS(TXB1D0,2)
// TXB1D0<TXB1D03>
extern volatile __bit                   TXB1D03             __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 TXB1D03_bit         _BIT_ACCESS(TXB1D0,3)
// TXB1D0<TXB1D04>
extern volatile __bit                   TXB1D04             __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 TXB1D04_bit         _BIT_ACCESS(TXB1D0,4)
// TXB1D0<TXB1D05>
extern volatile __bit                   TXB1D05             __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 TXB1D05_bit         _BIT_ACCESS(TXB1D0,5)
// TXB1D0<TXB1D06>
extern volatile __bit                   TXB1D06             __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 TXB1D06_bit         _BIT_ACCESS(TXB1D0,6)
// TXB1D0<TXB1D07>
extern volatile __bit                   TXB1D07             __at(0x79B7);	// @ (0xF36 * 8 + 7)
#define                                 TXB1D07_bit         _BIT_ACCESS(TXB1D0,7)
// TXB1D1<TXB1D10>
extern volatile __bit                   TXB1D10             __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 TXB1D10_bit         _BIT_ACCESS(TXB1D1,0)
// TXB1D1<TXB1D11>
extern volatile __bit                   TXB1D11             __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 TXB1D11_bit         _BIT_ACCESS(TXB1D1,1)
// TXB1D1<TXB1D12>
extern volatile __bit                   TXB1D12             __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 TXB1D12_bit         _BIT_ACCESS(TXB1D1,2)
// TXB1D1<TXB1D13>
extern volatile __bit                   TXB1D13             __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 TXB1D13_bit         _BIT_ACCESS(TXB1D1,3)
// TXB1D1<TXB1D14>
extern volatile __bit                   TXB1D14             __at(0x79BC);	// @ (0xF37 * 8 + 4)
#define                                 TXB1D14_bit         _BIT_ACCESS(TXB1D1,4)
// TXB1D1<TXB1D15>
extern volatile __bit                   TXB1D15             __at(0x79BD);	// @ (0xF37 * 8 + 5)
#define                                 TXB1D15_bit         _BIT_ACCESS(TXB1D1,5)
// TXB1D1<TXB1D16>
extern volatile __bit                   TXB1D16             __at(0x79BE);	// @ (0xF37 * 8 + 6)
#define                                 TXB1D16_bit         _BIT_ACCESS(TXB1D1,6)
// TXB1D1<TXB1D17>
extern volatile __bit                   TXB1D17             __at(0x79BF);	// @ (0xF37 * 8 + 7)
#define                                 TXB1D17_bit         _BIT_ACCESS(TXB1D1,7)
// TXB1D2<TXB1D20>
extern volatile __bit                   TXB1D20             __at(0x79C0);	// @ (0xF38 * 8 + 0)
#define                                 TXB1D20_bit         _BIT_ACCESS(TXB1D2,0)
// TXB1D2<TXB1D21>
extern volatile __bit                   TXB1D21             __at(0x79C1);	// @ (0xF38 * 8 + 1)
#define                                 TXB1D21_bit         _BIT_ACCESS(TXB1D2,1)
// TXB1D2<TXB1D22>
extern volatile __bit                   TXB1D22             __at(0x79C2);	// @ (0xF38 * 8 + 2)
#define                                 TXB1D22_bit         _BIT_ACCESS(TXB1D2,2)
// TXB1D2<TXB1D23>
extern volatile __bit                   TXB1D23             __at(0x79C3);	// @ (0xF38 * 8 + 3)
#define                                 TXB1D23_bit         _BIT_ACCESS(TXB1D2,3)
// TXB1D2<TXB1D24>
extern volatile __bit                   TXB1D24             __at(0x79C4);	// @ (0xF38 * 8 + 4)
#define                                 TXB1D24_bit         _BIT_ACCESS(TXB1D2,4)
// TXB1D2<TXB1D25>
extern volatile __bit                   TXB1D25             __at(0x79C5);	// @ (0xF38 * 8 + 5)
#define                                 TXB1D25_bit         _BIT_ACCESS(TXB1D2,5)
// TXB1D2<TXB1D26>
extern volatile __bit                   TXB1D26             __at(0x79C6);	// @ (0xF38 * 8 + 6)
#define                                 TXB1D26_bit         _BIT_ACCESS(TXB1D2,6)
// TXB1D2<TXB1D27>
extern volatile __bit                   TXB1D27             __at(0x79C7);	// @ (0xF38 * 8 + 7)
#define                                 TXB1D27_bit         _BIT_ACCESS(TXB1D2,7)
// TXB1D3<TXB1D30>
extern volatile __bit                   TXB1D30             __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 TXB1D30_bit         _BIT_ACCESS(TXB1D3,0)
// TXB1D3<TXB1D31>
extern volatile __bit                   TXB1D31             __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 TXB1D31_bit         _BIT_ACCESS(TXB1D3,1)
// TXB1D3<TXB1D32>
extern volatile __bit                   TXB1D32             __at(0x79CA);	// @ (0xF39 * 8 + 2)
#define                                 TXB1D32_bit         _BIT_ACCESS(TXB1D3,2)
// TXB1D3<TXB1D33>
extern volatile __bit                   TXB1D33             __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 TXB1D33_bit         _BIT_ACCESS(TXB1D3,3)
// TXB1D3<TXB1D34>
extern volatile __bit                   TXB1D34             __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 TXB1D34_bit         _BIT_ACCESS(TXB1D3,4)
// TXB1D3<TXB1D35>
extern volatile __bit                   TXB1D35             __at(0x79CD);	// @ (0xF39 * 8 + 5)
